knieriem/tinygo-stm32-svd/svd/stm32h745cm7.svd
        <register>
          <name>WPCR0</name>
          <displayName>WPCR0</displayName>
          <description>DSI wrapper PHY configuration register 0</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UIX4</name>
              <description>Unit interval multiplied by 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>SWCL</name>
              <description>Swap clock lane pins</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWDL0</name>
              <description>Swap data lane 0 pins</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWDL1</name>
              <description>Swap data lane 1 pins</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSICL</name>
              <description>Invert high</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIDL0</name>
              <description>Invert the high-speed data signal on data lane 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIDL1</name>
              <description>Invert the high-speed data signal on data lane 1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTXSMCL</name>
              <description>Force in TX Stop mode the clock lane</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTXSMDL</name>
              <description>Force in TX Stop mode the data lanes</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDOFFDL</name>
              <description>Contention detection OFF on data lanes</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDDL</name>
              <description>Turn disable data lanes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDEN</name>
              <description>Pull-down enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCLKPREPEN</name>
              <description>Custom time for tCLK</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCLKZEROEN</name>
              <description>Custom time for tCLK</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THSPREPEN</name>
              <description>Custom time for tHS</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THSTRAILEN</name>
              <description>Custom time for tHS</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THSZEROEN</name>
              <description>Custom time for tHS</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLPXDEN</name>
              <description>Custom time for tLPX for data lanes enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THSEXITEN</name>
              <description>Custom time for tHS</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TLPXCEN</name>
              <description>Custom time for tLPX for clock lane enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCLKPOSTEN</name>
              <description>Custom time for tCLK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPCR1</name>
          <displayName>WPCR1</displayName>
          <description>This register shall be programmed only when DSI is stopped (CR. DSIEN=0 and CR.EN = 0).</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HSTXDCL</name>
              <description>High-speed transmission delay on clock lane</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HSTXDDL</name>
              <description>High-speed transmission delay on data lanes</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPSRCCL</name>
              <description>Low-power transmission slew-rate compensation on clock lane</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPSRCDL</name>
              <description>Low-power transmission slew-rate compensation on data lanes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SDDC</name>
              <description>SDD control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSTXSRCCL</name>
              <description>High-speed transmission slew-rate control on clock lane</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HSTXSRCDL</name>
              <description>High-speed transmission slew-rate control on data lanes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLPRXLPM</name>
              <description>Forces LP receiver in low-power mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPRXFT</name>
              <description>Low-power RX low-pass filtering tuning</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPCR2</name>
          <displayName>WPCR2</displayName>
          <description>DSI wrapper PHY configuration register 2</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCLKPREP</name>
              <description>tCLK-PREPARE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TCLKZERO</name>
              <description>tCLK-ZERO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>THSPREP</name>
              <description>tHS-PREPARE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>THSTRAIL</name>
              <description>tHSTRAIL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPCR3</name>
          <displayName>WPCR3</displayName>
          <description>DSI wrapper PHY configuration register 3</description>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>THSZERO</name>
              <description>tHS-ZERO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TLPXD</name>
              <description>tLPX for data lanes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>THSEXIT</name>
              <description>tHSEXIT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TLPXC</name>
              <description>tLPXC for clock lane</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPCR4</name>
          <displayName>WPCR4</displayName>
          <description>DSI wrapper PHY configuration register 4</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCLKPOST</name>
              <description>tCLK-POST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPCR</name>
          <displayName>WRPCR</displayName>
          <description>DSI wrapper regulator and PLL control register</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PLLEN</name>
              <description>PLL enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDIV</name>
              <description>PLL loop division factor</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>IDF</name>
              <description>PLL input division factor</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ODF</name>
              <description>PLL output division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>REGEN</name>
              <description>Regulator enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
