knieriem/tinygo-stm32-svd/svd/stm32h745cm7.svd
        <register>
          <name>ADC2R</name>
          <displayName>ADC2R</displayName>
          <description>ADC Trigger 2 Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRST</name>
              <description>ADC trigger 2 on Timer C
              Reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CRST</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No generation of ADC trigger on timer reset and roll-over</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Generation of ADC trigger on timer reset and roll-over</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERST</name>
              <description>ADC trigger 2 on Timer E
              Reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CRST"/>
            </field>
            <field>
              <name>AC2</name>
              <description>ADC trigger 2 on Timer A compare
              2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>AC2</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No generation of ADC trigger on timer compare event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Generation of ADC trigger on timer compare event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EC4</name>
              <description>ADC trigger 2 on Timer E compare
              4</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>EC3</name>
              <description>ADC trigger 2 on Timer E compare
              3</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>EC2</name>
              <description>ADC trigger 2 on Timer E compare
              2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>DRST</name>
              <description>ADC trigger 2 on Timer D
              Reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CRST"/>
            </field>
            <field>
              <name>MPER</name>
              <description>ADC trigger 2 on Master
              Period</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MPER</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No generation of ADC trigger on timer period event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Generation of ADC trigger on timer period event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPER</name>
              <description>ADC trigger 2 on Timer D
              Period</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MPER"/>
            </field>
            <field>
              <name>DC4</name>
              <description>ADC trigger 2 on Timer D compare
              4</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>DC3</name>
              <description>ADC trigger 2 on Timer D compare
              3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>DC2</name>
              <description>ADC trigger 2 on Timer D compare
              2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>CPER</name>
              <description>ADC trigger 2 on Timer C
              Period</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MPER"/>
            </field>
            <field>
              <name>CC4</name>
              <description>ADC trigger 2 on Timer C compare
              4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>CC3</name>
              <description>ADC trigger 2 on Timer C compare
              3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>CC2</name>
              <description>ADC trigger 2 on Timer C compare
              2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>BPER</name>
              <description>ADC trigger 2 on Timer B
              Period</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MPER"/>
            </field>
            <field>
              <name>BC4</name>
              <description>ADC trigger 2 on Timer B compare
              4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>BC3</name>
              <description>ADC trigger 2 on Timer B compare
              3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>BC2</name>
              <description>ADC trigger 2 on Timer B compare
              2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>APER</name>
              <description>ADC trigger 2 on Timer A
              Period</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MPER"/>
            </field>
            <field>
              <name>AC4</name>
              <description>ADC trigger 2 on Timer A compare
              4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <name>AC3</name>
              <description>ADC trigger 2 on Timer A compare
              3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="AC2"/>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>6-10</dimIndex>
              <name>EEV%s</name>
              <description>ADC trigger 2 on External Event
              %s</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EEV6</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No generation of ADC trigger on external event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Generation of ADC trigger on external event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>MC%s</name>
              <description>ADC trigger 2 on Master Compare
              %s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MC1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No generation of ADC trigger on master compare event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Generation of ADC trigger on master compare event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register derivedFrom="ADC1R">
          <name>ADC3R</name>
          <displayName>ADC3R</displayName>
          <description>ADC Trigger 3 Register</description>
          <addressOffset>0x44</addressOffset>
        </register>
