knieriem/tinygo-stm32-svd/svd/stm32h745cm7.svd
        <register derivedFrom="ADC2R">
          <name>ADC4R</name>
          <displayName>ADC4R</displayName>
          <description>ADC Trigger 4 Register</description>
          <addressOffset>0x48</addressOffset>
        </register>
        <register>
          <name>FLTINR1</name>
          <displayName>FLTINR1</displayName>
          <description>HRTIM Fault Input Register 1</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLT1LCK</name>
              <description>FLT1LCK</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLT1LCKR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Fault bits are read/write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Fault bits are read-only</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>FLT1LCKW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Lock</name>
                  <description>Lock corresponding fault bits</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLT4LCK</name>
              <description>FLT4LCK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="FLT1LCKR">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="FLT1LCKW">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>FLT%sF</name>
              <description>FLT%sF</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>FLT1F</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No filter, FLTx acts asynchronously</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div1_N2</name>
                  <description>f_SAMPLING=f_HRTIM, N=2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div1_N4</name>
                  <description>f_SAMPLING=f_HRTIM, N=4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div1_N8</name>
                  <description>f_SAMPLING=f_HRTIM, N=8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2_N6</name>
                  <description>f_SAMPLING=f_HRTIM/2, N=6</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2_N8</name>
                  <description>f_SAMPLING=f_HRTIM/2, N=8</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4_N6</name>
                  <description>f_SAMPLING=f_HRTIM/4, N=6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4_N8</name>
                  <description>f_SAMPLING=f_HRTIM/4, N=8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8_N6</name>
                  <description>f_SAMPLING=f_HRTIM/8, N=6</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8_N8</name>
                  <description>f_SAMPLING=f_HRTIM/8, N=8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16_N5</name>
                  <description>f_SAMPLING=f_HRTIM/16, N=5</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16_N6</name>
                  <description>f_SAMPLING=f_HRTIM/16, N=6</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16_N8</name>
                  <description>f_SAMPLING=f_HRTIM/16, N=8</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32_N5</name>
                  <description>f_SAMPLING=f_HRTIM/32, N=5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32_N6</name>
                  <description>f_SAMPLING=f_HRTIM/32, N=6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32_N8</name>
                  <description>f_SAMPLING=f_HRTIM/32, N=8</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>FLT%sSRC</name>
              <description>Fault %s source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLT1SRC</name>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Fault input is FLTx input pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Internal</name>
                  <description>Fault input is FLTn_Int signal</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>FLT%sP</name>
              <description>FLT%sP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLT1P</name>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>Fault input is active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>Fault input is active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>FLT%sE</name>
              <description>FLT%sE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLT1E</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Fault input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Fault input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLT3LCK</name>
              <description>FLT3LCK</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="FLT1LCKR">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="FLT1LCKW">
                <usage>write</usage>
              </enumeratedValues>
            </field>
            <field>
              <name>FLT2LCK</name>
              <description>FLT2LCK</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="FLT1LCKR">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="FLT1LCKW">
                <usage>write</usage>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLTINR2</name>
          <displayName>FLTINR2</displayName>
          <description>HRTIM Fault Input Register 2</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLTSD</name>
              <description>FLTSD</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>FLTSD</name>
                <enumeratedValue>
                  <name>Div1</name>
                  <description>f_FLTS=f_HRTIM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>f_FLTS=f_HRTIM/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>f_FLTS=f_HRTIM/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>f_FLTS=f_HRTIM/8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLT5LCK</name>
              <description>FLT5LCK</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLT5LCKR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Fault bits are read/write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Fault bits are read-only</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>FLT5LCKW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Lock</name>
                  <description>Lock corresponding fault bits</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>1</dim>
              <dimIncrement>0x0</dimIncrement>
              <dimIndex>5-5</dimIndex>
              <name>FLT%sF</name>
              <description>FLT%sF</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>FLT5F</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No filter, FLTx acts asynchronously</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div1_N2</name>
                  <description>f_SAMPLING=f_HRTIM, N=2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div1_N4</name>
                  <description>f_SAMPLING=f_HRTIM, N=4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div1_N8</name>
                  <description>f_SAMPLING=f_HRTIM, N=8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2_N6</name>
                  <description>f_SAMPLING=f_HRTIM/2, N=6</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2_N8</name>
                  <description>f_SAMPLING=f_HRTIM/2, N=8</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4_N6</name>
                  <description>f_SAMPLING=f_HRTIM/4, N=6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4_N8</name>
                  <description>f_SAMPLING=f_HRTIM/4, N=8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8_N6</name>
                  <description>f_SAMPLING=f_HRTIM/8, N=6</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8_N8</name>
                  <description>f_SAMPLING=f_HRTIM/8, N=8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16_N5</name>
                  <description>f_SAMPLING=f_HRTIM/16, N=5</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16_N6</name>
                  <description>f_SAMPLING=f_HRTIM/16, N=6</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16_N8</name>
                  <description>f_SAMPLING=f_HRTIM/16, N=8</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32_N5</name>
                  <description>f_SAMPLING=f_HRTIM/32, N=5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32_N6</name>
                  <description>f_SAMPLING=f_HRTIM/32, N=6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32_N8</name>
                  <description>f_SAMPLING=f_HRTIM/32, N=8</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>1</dim>
              <dimIncrement>0x0</dimIncrement>
              <dimIndex>5-5</dimIndex>
              <name>FLT%sSRC</name>
              <description>Fault %s source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLT5SRC</name>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Fault input is FLTx input pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Internal</name>
                  <description>Fault input is FLTn_Int signal</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>1</dim>
              <dimIncrement>0x0</dimIncrement>
              <dimIndex>5-5</dimIndex>
              <name>FLT%sP</name>
              <description>FLT%sP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLT5P</name>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>Fault input is active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>Fault input is active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>1</dim>
              <dimIncrement>0x0</dimIncrement>
              <dimIndex>5-5</dimIndex>
              <name>FLT%sE</name>
              <description>FLT%sE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLT5E</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Fault input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Fault input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMUPR</name>
          <displayName>BDMUPDR</displayName>
          <description>BDMUPDR</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCR</name>
              <description>MCR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MCR</name>
                <enumeratedValue>
                  <name>NotUpdated</name>
                  <description>Register not updated by burst DMA access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Updated</name>
                  <description>Register updated by burst DMA access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCMP4</name>
              <description>MCMP4</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MCR"/>
            </field>
            <field>
              <name>MCMP3</name>
              <description>MCMP3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MCR"/>
            </field>
            <field>
              <name>MCMP2</name>
              <description>MCMP2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MCR"/>
            </field>
            <field>
              <name>MCMP1</name>
              <description>MCMP1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MCR"/>
            </field>
            <field>
              <name>MREP</name>
              <description>MREP</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MCR"/>
            </field>
            <field>
              <name>MPER</name>
              <description>MPER</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MCR"/>
            </field>
            <field>
              <name>MCNT</name>
              <description>MCNT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MCR"/>
            </field>
            <field>
              <name>MDIER</name>
              <description>MDIER</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MCR"/>
            </field>
            <field>
              <name>MICR</name>
              <description>MICR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MCR"/>
            </field>
          </fields>
        </register>
